Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Where floor level signs are provided in interior exit stairways and ramps, a floor-level sign identifying the floor level in visual characters, raised characters and braille complying with ICC A117.1 shall be located at each floor-level landing adjacent to the door leading from the interior exit stairway and ramp into the corridor.
fr_ca: Lorsque des panneaux indiquant le niveau d’étage sont installés dans les escaliers et les rampes d’issue intérieurs, un panneau indiquant le niveau d’étage au moyen de caractères visuels, de caractères en relief et du braille conformes à la norme ICC A117.1 doit être installé à chaque palier d’étage, à côté de la porte donnant de l’escalier d’issue intérieur et de la rampe d’issue intérieure sur le corridor.

source: Where four or more elevator cars serve all or the same portion of a building, the elevators shall be located in not fewer than two separate hoistways.
fr_ca: Lorsque quatre cabines d'ascenseur ou plus desservent tout ou la même partie d'un bâtiment, les ascenseurs doivent être situés dans au moins deux cages séparées.

source: Where glass doors are provided in the glass wall, they shall be either self-closing or automatic-closing.
fr_ca: Lorsque des portes en verre sont prévues dans le mur vitré, elles doivent être soit à fermeture automatique, soit à fermeture commandée automatiquement.

source: Where handrails are provided along walking surfaces with slopes not steeper than 1:20, the bottoms of handrail gripping surfaces shall be permitted to be obstructed along their entire length where they are integral to crash rails or bumper guards.
fr_ca: Lorsque des rampes sont prévues le long de surfaces de circulation dont la pente n'est pas supérieure à 1:20, le bas des surfaces de préhension des rampes peut être obstrué sur toute sa longueur lorsqu'il fait partie intégrante des barres de protection ou des garde-corps.

source: Where handrails or handrail extensions bend or turn corners, the stripe shall not have a gap of more than 4 inches (102 mm).
fr_ca: Lorsque les mains courantes ou les extensions de mains courantes sont courbées ou tournent dans les coins, la bande ne doit pas comporter d'espace de plus de 4 po ^(102 mm).

source: Where in-car signals are provided they shall be visible from the floor area adjacent to the hall call buttons.
fr_ca: Lorsque des signaux dans la cabine sont prévus, ils doivent être visibles depuis la surface de plancher adjacente aux boutons d'appel de hall.

source: Where installed in accordance with Section 3008, passenger elevators for general public use shall be permitted to be used for occupant self-evacuation.
fr_ca: Lorsqu’ils sont installés conformément à l’article 3008, les ascenseurs pour passagers destinés à l’usage général du public peuvent être utilisés pour l’auto-évacuation des occupants.

source: Where installed in buildings without commercial power, battery-powered carbon monoxide alarms shall be an acceptable alternative.
fr_ca: Lorsqu'ils sont installés dans des bâtiments sans alimentation commerciale, les alarmes de monoxyde de carbone alimentées par batterie constituent une solution de rechange acceptable.

source: Where installed in locations specified in Section 613.2.3, end maneuvering clearances complying with Section 613.4.4.2 are not required.
fr_ca: Lorsqu'ils sont installés dans les emplacements spécifiés à la section 613.2.3, les espaces de dégagement d'extrémité conformes à la section 613.4.4.2 ne sont pas requis.

source: Where interior exit stairways and ramps are extended to an exit discharge or a public way by an exit passageway, the interior exit stairway and ramp shall be separated from the exit passageway by a fire barrier constructed in accordance with Section 707 or a horizontal assembly constructed in accordance with Section 711, or both.
fr_ca: Lorsque des escaliers et des rampes d’issue intérieurs sont prolongés jusqu’à un niveau d’évacuation menant à l’extérieur ou à une voie publique par un passage d’issue, l’escalier ou la rampe d’issue intérieurs doit être séparé du passage d’issue par une séparation coupe-feu construite conformément à la section 707 ou par un assemblage horizontal construit conformément à la section 711, ou par les deux.

source: Where it is required that documents be prepared by a registered design professional, the building official shall be authorized to require the owner or the owner's authorized agent to engage and designate on the building permit application a registered design professional who shall act as the registered design professional in responsible charge.
fr_ca: Lorsqu’il est exigé que les documents soient préparés par un professionnel de la conception enregistré, le responsable de la construction est autorisé à exiger du propriétaire ou de son mandataire autorisé qu’il engage et désigne, dans la demande de permis de construire, un professionnel de la conception enregistré qui agira à titre de professionnel de la conception enregistré responsable.

source: Where located in Group R-2 college dormitories, domestic cooking appliances for use by residents shall be in compliance with all of the following:
fr_ca: Lorsqu'ils sont situés dans des dortoirs universitaires du groupe R-2, les appareils de cuisson domestiques destinés à être utilisés par les résidents doivent être conformes à toutes les exigences suivantes :

source: Where located within the building, the equipment and ductwork shall be separated from the remainder of the building, including other mechanical equipment, with construction as required for shafts.
fr_ca: Lorsque les équipements et les conduits sont situés à l’intérieur du bâtiment, ils doivent être séparés du reste du bâtiment, y compris des autres équipements mécaniques, par une construction conforme aux exigences applicables aux puits.

source: Where lockers constructed of combustible materials are used, the lockers shall be considered to be interior finish and shall comply with Section 803.
fr_ca: Lorsque des casiers construits en matériaux combustibles sont utilisés, les casiers doivent être considérés comme des revêtements intérieurs et doivent être conformes à la section 803.

source: Where masonry fireplaces are part of masonry or concrete walls, combustible materials shall not be in contact with the masonry or concrete walls less than 12 inches (306 mm) from the inside surface of the nearest firebox lining.
fr_ca: Lorsque les foyers en maçonnerie font partie de murs en maçonnerie ou en béton, les matériaux combustibles ne doivent pas être en contact avec les murs en maçonnerie ou en béton à moins de 12 po [306 mm] de la surface intérieure du revêtement de la chambre de combustion le plus proche.

source: Where mid-aisle handrails are provided in stepped aisles, there shall be an additional rail located approximately 12 inches (305 mm) below the handrail.
fr_ca: Lorsque des mains courantes intermédiaires sont prévues dans des allées à gradins, une main courante supplémentaire doit être installée à environ 12 po (305 mm) sous la main courante.

source: Where more than one carbon monoxide alarm is required to be installed within an individual dwelling unit in accordance with Section R315.3, the alarm devices shall be interconnected in such a manner that the actuation of one alarm will activate all of the alarms in the individual dwelling unit.
fr_ca: Lorsqu'il est exigé d'installer plus d'un détecteur de monoxyde de carbone dans un logement individuel selon la section R315.3, les dispositifs d'alarme doivent être interconnectés de manière à ce que le déclenchement d'un détecteur active tous les détecteurs du logement individuel.

source: Where more than one means of egress is required by Section 1006.2 or 1006.3 from any accessible space, each accessible portion of the space shall be served by not less than two accessible means of egress.
fr_ca: Lorsque plus d’un moyen d’évacuation est exigé par la section 1006.2 ou 1006.3 à partir d’un espace accessible, chaque partie accessible de l’espace doit être desservie par au moins deux moyens d’évacuation accessibles.

source: Where more than one smoke alarm is required to be installed within an individual dwelling unit in accordance with Section R314.3, the alarm devices shall be interconnected in such a manner that the actuation of one alarm will activate all of the alarms in the individual dwelling unit.
fr_ca: Lorsqu'il est exigé d'installer plus d'un détecteur de fumée dans un logement individuel selon la section R314.3, les dispositifs d'alarme doivent être interconnectés de manière à ce que le déclenchement d'un détecteur active tous les détecteurs du logement individuel.

source: Where multiple grab bars are used, required horizontal grab bars shall be installed at the same height above the floor.
fr_ca: Lorsque plusieurs barres d'appui sont utilisées, les barres d'appui horizontales exigées doivent être installées à la même hauteur au-dessus du sol.

source: Where multiple single-user toilet rooms or bathing rooms are clustered at a single location, at least 50 percent but not less than one room for each use at each cluster shall be accessible.
fr_ca: Lorsque plusieurs toilettes ou salles de bain à un seul utilisateur sont regroupées en un seul endroit, au moins 50 pour cent, mais pas moins d’une salle de chaque utilisation dans chaque regroupement, doivent être accessibles.

source: Where no more than one urinal is provided in a toilet room or bathing room, the urinal is not required to be accessible.
fr_ca: Lorsqu'il n'y a pas plus d'un urinoir dans une toilette ou une salle de bain, l'urinoir n'est pas tenu d'être accessible.

source: Where nonrated walls or unprotected openings enclose the exterior of the exit passageway and the walls or openings are exposed by other parts of the building at an angle of less than 180 degrees (3.14 rad), the building exterior walls within 10 feet (3048 mm) horizontally of a nonrated wall or unprotected opening shall have a fire-resistance rating of not less than 1 hour.
fr_ca: Lorsque des murs sans degré de résistance au feu ou des ouvertures non protégées forment l’enveloppe extérieure du passage d’issue et que ces murs ou ouvertures sont exposés à d’autres parties du bâtiment selon un angle inférieur à 180 degrés (3,14 rad), les murs extérieurs du bâtiment situés à moins de 10 pi (3 048 mm) horizontalement d’un mur sans degré de résistance au feu ou d’une ouverture non protégée doivent avoir un degré de résistance au feu d’au moins 1 heure.

source: Where nonrated walls or unprotected openings enclose the exterior of the stairway or ramps and the walls or openings are exposed by other parts of the building at an angle of less than 180 degrees (3.14 rad), the building exterior walls within 10 feet (3048 mm) horizontally of a nonrated wall or unprotected opening shall have a fire-resistance rating of not less than 1 hour.
fr_ca: Lorsque des murs sans degré de résistance au feu ou des ouvertures non protégées forment l’enveloppe extérieure de l’escalier ou des rampes et que ces murs ou ouvertures sont exposés à d’autres parties du bâtiment selon un angle inférieur à 180 degrés (3,14 rad), les murs extérieurs du bâtiment situés à moins de 3 048 mm (10 pi) horizontalement d’un mur sans degré de résistance au feu ou d’une ouverture non protégée doivent avoir un degré de résistance au feu d’au moins 1 heure.

source: Where nonuniformities exceed 3/16 inch (4.8 mm) between adjacent risers, the exact location of such nonuniformities shall be indicated with a distinctive marking stripe on each tread at the nosing or leading edge adjacent to the nonuniform risers.
fr_ca: Lorsque les écarts de hauteur entre des contremarches adjacentes sont supérieurs à 3/16 po (4,8 mm), l’emplacement exact de ces écarts doit être indiqué au moyen d’une bande de marquage distinctive sur chaque giron, au niveau du nez de marche ou du bord avant adjacent aux contremarches non uniformes.

source: Where one of the two paths of travel is across the aisle through a row of seats to another aisle, there shall be not more than 24 seats between the two aisles, and the minimum clear width between rows for the row between the two aisles shall be 12 inches (305 mm) plus 0.6 inch (15.2 mm) for each additional seat above seven in the row between aisles.
fr_ca: Lorsque l’un des deux parcours se fait à travers l’allée, en passant par une rangée de sièges jusqu’à une autre allée, il ne doit pas y avoir plus de 24 sièges entre les deux allées, et la largeur libre minimale entre les rangées pour la rangée située entre les deux allées doit être de 12 po (305 mm), plus 0,6 po (15,2 mm) pour chaque siège supplémentaire au-delà de sept dans la rangée située entre les allées.

source: Where only one accessible route is provided, the accessible route shall not pass through kitchens, storage rooms, restrooms, closets or similar spaces.
fr_ca: Lorsqu'un seul itinéraire accessible est prévu, l'itinéraire accessible ne doit pas passer par des cuisines, des pièces d'entreposage, des toilettes, des placards ou des espaces similaires.

source: Where openings below grade provide required natural ventilation, the outside horizontal clear space measured perpendicular to the opening shall be one and one-half times the depth of the opening.
fr_ca: Lorsque des ouvertures situées sous le niveau du sol assurent la ventilation naturelle requise, l’espace libre horizontal extérieur mesuré perpendiculairement à l’ouverture doit être égal à une fois et demie la profondeur de l’ouverture.

source: Where openings in a story are provided on only one side and the opposite wall of such story is more than 75 feet (22 860 mm) from such openings, the story shall be equipped throughout with an approved automatic sprinkler system, or openings shall be provided on not fewer than two sides of the story.
fr_ca: Lorsque les ouvertures d’un étage sont prévues sur un seul côté et que le mur opposé de cet étage se trouve à plus de 75 pieds (22 860 mm) de ces ouvertures, l’étage doit être entièrement équipé d’un système d’extincteurs automatiques approuvé, ou des ouvertures doivent être prévues sur au moins deux côtés de l’étage.

source: Where operable windows are provided in an accessible room or space, at least one shall comply with Section 506.
fr_ca: Lorsque des fenêtres ouvrantes sont prévues dans une pièce ou une aire accessible, au moins une d'entre elles doit être conforme à la section 506.

source: Where operable windows are required to provide natural ventilation or operable windows are required to provide an emergency escape and rescue opening, that window shall be the operable window that complies with Section 506.
fr_ca: Lorsque des fenêtres ouvrantes sont requises pour assurer une ventilation naturelle ou que des fenêtres ouvrantes sont requises pour fournir une ouverture d'évacuation et de sauvetage d'urgence, cette fenêtre doit être la fenêtre ouvrante qui se conforme à la section 506.

source: Where other glass types are used, the design shall be submitted to the building official for approval.
fr_ca: Lorsque d'autres types de verre sont utilisés, la conception doit être soumise au responsable de la construction pour approbation.

source: Where other sections of this code allow elimination of fire alarm boxes due to sprinklers, a single fire alarm box shall be installed.
fr_ca: Lorsque d’autres sections du présent code permettent de supprimer les déclencheurs d’alarme d’incendie en raison de la présence d’extincteurs automatiques, un seul déclencheur d’alarme d’incendie doit être installé.

source: Where pass-through openings are provided in smoke partitions in Group I-2, Condition 2 occupancies, such openings shall comply with the following:
fr_ca: Lorsque des ouvertures de passage sont prévues dans des cloisons pare-fumée dans les établissements du groupe I-2, condition 2, ces ouvertures doivent satisfaire aux exigences suivantes :

source: Where permitted by the door manufacturer's listing, positive-latching devices are not required.
fr_ca: Lorsque l'homologation du fabricant de la porte le permet, les dispositifs de verrouillage positif ne sont pas exigés.

source: Where permitted in accordance with Section 407.3.1.1.
fr_ca: Lorsque cela est autorisé selon la section 407.3.1.1.

source: Where photoluminescent exit path markings are installed, they shall be provided with not less than 1 footcandle (11 lux) of illumination for not less than 60 minutes prior to periods when the building is occupied and continuously during occupancy.
fr_ca: Lorsque des marquages photoluminescents du chemin d’évacuation sont installés, ils doivent être éclairés à raison d’au moins 1 pied-bougie (11 lux) pendant au moins 60 minutes avant les périodes d’occupation du bâtiment et de façon continue pendant l’occupation.

source: Where pictograms are provided as designations for toilet rooms and bathing rooms, the pictograms shall have visual characters, raised characters and braille complying with ICC A117.1.
fr_ca: Lorsque des pictogrammes sont prévus pour désigner les cabinets de toilette et les salles de bain, les pictogrammes doivent comporter des caractères visuels, des caractères en relief et du braille conformes à la norme ICC A117.1.

source: Where pictograms are provided as designations of permanent interior rooms and spaces, the pictograms shall comply with Section 703.5 and shall have text descriptors located directly below the pictogram field and complying with Sections 703.2 and 703.3.
fr_ca: Lorsque des pictogrammes sont prévus pour désigner des pièces et des espaces intérieurs permanents, les pictogrammes doivent être conformes à la section 703.5 et doivent comporter des descriptions textuelles situées directement sous le champ du pictogramme et conformes aux sections 703.2 et 703.3.

source: Where protection of openings is required, exterior exit doors shall be protected with fire door assemblies that comply with Section 716.
fr_ca: Lorsque la protection des ouvertures est requise, les portes de sortie extérieures doivent être protégées par des portes coupe-feu qui sont conformes à la section 716.

source: Where provided in below-grade transportation stations, escalators shall have a clear width of not less than 32 inches (815 mm).
fr_ca: Lorsqu'elles sont installées dans des stations de transport souterraines, les escaliers mécaniques doivent avoir une largeur libre d'au moins 32 po (815 mm).

source: Where provided in buildings that are designated as emergency shelters, variable message signs conveying emergency-related information shall comply with Section 1112.5.
fr_ca: Lorsqu’ils sont installés dans des bâtiments désignés comme refuges d’urgence, les panneaux à messages variables qui transmettent des renseignements liés aux situations d’urgence doivent être conformes à la section 1112.5.

source: Where provided in the locations in Sections 1112.5.1 and 1112.5.2, variable message signs shall comply with the variable message sign requirements of ICC A117.1.
fr_ca: Lorsqu'ils sont prévus aux emplacements indiqués dans les articles 1112.5.1 et 1112.5.2, les panneaux à message variable doivent être conformes aux exigences de la norme ICC A117.1 en matière de panneaux à message variable.

source: Where provided in transportation facilities, variable message signs conveying transportation-related information shall comply with Section 1112.5.
fr_ca: Lorsqu’ils sont installés dans des installations de transport, les panneaux à messages variables qui transmettent des renseignements liés au transport doivent être conformes à la section 1112.5.

source: Where provided, a bathtub shall comply with Section 1104.11.3.1.3.1 or 1104.11.3.1.3.2 and a shower compartment shall comply with Section 1104.11.3.1.3.3.
fr_ca: Lorsqu'elle est prévue, une baignoire doit se conformer à la section 1104.11.3.1.3.1 ou 1104.11.3.1.3.2 et un compartiment de douche doit se conformer à la section 1104.11.3.1.3.3.

source: Where provided, a shelf shall be 40 inches (1015 mm) minimum and 48 inches (1220 mm) maximum above the floor.
fr_ca: Lorsqu'elle est prévue, une tablette doit être installée à une hauteur comprise entre 40 po [1015 mm] et 48 po [1220 mm] au-dessus du sol.

source: Where provided, adult changing stations shall be installed in accordance with the locations specified in Section 613.2.1, 613.2.2 or 613.2.3.
fr_ca: Lorsqu'elles sont prévues, les tables à langer pour adultes doivent être installées conformément aux emplacements spécifiés à la section 613.2.1, 613.2.2 ou 613.2.3.

source: Where provided, an adjustable-height hand shower mounted on a vertical bar shall be installed so as to not obstruct the use of grab bars.
fr_ca: Le cas échéant, une douchette à main à hauteur réglable montée sur une barre verticale doit être installée de manière à ne pas gêner l'utilisation des barres d'appui.

source: Where provided, direct access for pedestrians from parking structures to buildings or facility entrances shall be accessible.
fr_ca: Lorsqu’un accès direct pour les piétons est prévu entre les garages de stationnement et les bâtiments ou les entrées des établissements, cet accès doit être accessible.

source: Where provided, kitchen appliances shall comply with Section 1103.12.5.
fr_ca: Lorsqu'ils sont prévus, les appareils de cuisine doivent être conformes à la section 1103.12.5.

source: Where provided, kitchen appliances shall comply with Section 804.5.
fr_ca: Lorsqu'ils sont prévus, les appareils de cuisine doivent être conformes à la section 804.5.

source: Where provided, the manual fire alarm box shall not be located in an area that is open to the public.
fr_ca: Lorsqu'il est prévu, le déclencheur manuel d’alarme d'incendie ne doit pas être situé dans une zone ouverte au public.

source: Where provided, unit smoke detection shall include audible notification complying with NFPA 72 listed in Section 106.2.4.
fr_ca: Lorsqu'elle est prévue, la détection de fumée de l'unité doit comprendre une notification sonore conforme à la norme NFPA 72 énumérée à la section 106.2.4.

source: Where pumps are located more than 2 feet (609 mm) from the access opening, an opening not less than 18 inches by 18 inches (457 mm by 457 mm) shall be installed.
fr_ca: Lorsque les pompes sont situées à plus de 2 pi [609 mm] de l'ouverture d'accès, une ouverture d'au moins 18 po sur 18 po [457 mm sur 457 mm] doit être installée.

source: Where required by Section 403.5.4, 405.7.2 or 412.2.2.1, interior exit stairways and ramps shall be smokeproof enclosures in accordance with Section 909.20.
fr_ca: Lorsqu’ils sont exigés par la section 403.5.4, 405.7.2 ou 412.2.2.1, les escaliers et les rampes d’issue intérieurs doivent être des enceintes à l’épreuve de la fumée conformes à la section 909.20.

source: Where required by Section 915.1.1, carbon monoxide detection shall be installed in the locations specified in Sections 915.2.1 through 915.2.3.
fr_ca: Lorsque la section 915.1.1 l’exige, la détection de monoxyde de carbone doit être installée aux endroits précisés aux sections 915.2.1 à 915.2.3.

source: Where required by other sections of the code, glazing shall be tested in accordance with CPSC 16 CFR 1201.
fr_ca: Lorsque d'autres articles du code l'exigent, le vitrage doit être testé conformément à la norme CPSC 16 CFR 1201.

source: Where required by the International Mechanical Code, automatic sprinklers shall be provided in ducts conveying hazardous exhaust or flammable or combustible materials.
fr_ca: Lorsque l’International Mechanical Code l’exige, des extincteurs automatiques doivent être prévus dans les gaines transportant des rejets dangereux ou des matières inflammables ou combustibles.
